DiathesisRaceTable = {
	[1] = {1000,nil,1001,nil,1002,1004,1003,nil,1006,nil,1007,nil,1008,1009,1010,1011,nil,1005,nil,nil},--战士
	[2] = {2000,nil,2001,nil,2002,2005,2006,nil,2004,nil,2007,nil,2008,2009,2010,2011,nil,2003,nil,nil},--法师
	[3] = {3000,nil,3001,nil,3002,3007,3003,nil,3004,nil,3006,nil,3008,3009,3010,3011,nil,3005,nil,nil},--枪手
	[4] = {4000,nil,4001,nil,4002,4007,4003,nil,4004,nil,4006,nil,4008,4009,4010,4011,nil,4005,nil,nil},--祭祀
	
	[17] = {1100,nil,1102,nil,nil,1103,nil,1104,1110,1109,1105,nil,nil,1106,nil,nil,1101,nil,1107,nil},
	[34] = {2100,nil,2102,nil,nil,2104,nil,2103,2109,2110,2105,nil,nil,2106,nil,nil,2101,nil,2107,nil},
	[19] = {3100,nil,3102,nil,nil,3104,nil,3103,3109,3110,3105,nil,nil,3106,nil,nil,3107,nil,3101,nil},
	[20] = {4100,nil,4102,nil,nil,4105,nil,4104,4110,4109,4103,nil,nil,4106,nil,nil,4101,nil,4107,nil},
	
	[33] = {1200,nil,1202,nil,nil,1203,nil,1204,1205,1210,nil,1209,1201,nil,1206,nil,nil,1207,nil,nil},
	[18] = {2200,nil,2202,nil,nil,2203,nil,2204,nil,2209,2206,nil,2205,nil,2210,nil,2201,2207,nil,nil},
	[35] = {3200,nil,3202,nil,nil,3205,nil,3207,3210,3209,3204,nil,nil,3203,nil,nil,3201,nil,3207,nil},
	[36] = {4200,nil,4202,nil,nil,4205,nil,4204,4210,4209,4206,nil,nil,4203,nil,nil,4201,nil,4207,nil},
}