
proc 1
	var 10 0
	set_pworld_var 0 32 @10 1
	var 20 0
	set_pworld_var 4 8 @20 1

endproc 


proc 100

	var 30 10
	;重刷时间
	var 10 10
	;停留时间
	;左上
	add_tmp_item 1440002 1 4300 14200 800  0 @30 @10 1
	add_tmp_item 1440002 1 5400 14300 800  0 @30 @10 1
	add_tmp_item 1440002 1 6800 14000 800  0 @30 @10 1
	add_tmp_item 1440002 1 6600 12800 800  0 @30 @10 1
	add_tmp_item 1440002 1 6500 11100 800  0 @30 @10 1
	add_tmp_item 1440002 1 5200 12100 800  0 @30 @10 1
	add_tmp_item 1440002 1 4100 13100 800  0 @30 @10 1
	                                     
	add_tmp_item 1440003 1 4300 14200 800 0 @30 @10 1
	add_tmp_item 1440003 1 5400 14300 800 0 @30 @10 1
	add_tmp_item 1440003 1 6800 14000 800 0 @30 @10 1
	add_tmp_item 1440003 1 6600 12800 800 0 @30 @10 1
	add_tmp_item 1440003 1 6500 11100 800 0 @30 @10 1
	add_tmp_item 1440003 1 5200 12100 800 0 @30 @10 1
	add_tmp_item 1440003 1 4100 13100 800 0 @30 @10 1
;;;;;;;;;;;                                 
	;左下
	add_tmp_item 1440002 1 4300 4100 800 0 @30 @10 1
	add_tmp_item 1440002 1 3800 5600 800 0 @30 @10 1
	add_tmp_item 1440002 1 4300 7000 800 0 @30 @10 1
	add_tmp_item 1440002 1 5800 6900 800 0 @30 @10 1
	add_tmp_item 1440002 1 7600 6500 800 0 @30 @10 1
	add_tmp_item 1440002 1 7600 4500 800 0 @30 @10 1
	add_tmp_item 1440002 1 5500 4800 800 0 @30 @10 1
	                                       
	
	add_tmp_item 1440003 1 4300 4100 800 0 @30 @10 1
	add_tmp_item 1440003 1 3800 5600 800 0 @30 @10 1
	add_tmp_item 1440003 1 4300 7000 800 0 @30 @10 1
	add_tmp_item 1440003 1 5800 6900 800 0 @30 @10 1
	add_tmp_item 1440003 1 7600 6500 800 0 @30 @10 1
	add_tmp_item 1440003 1 7600 4500 800 0 @30 @10 1
	add_tmp_item 1440003 1 5500 4800 800 0 @30 @10 1
	                                       
;;;;;;
;右上
	add_tmp_item 1440002 1 13700 13600 800 0 @30 @10 1
	add_tmp_item 1440002 1 12700 13500 800 0 @30 @10 1
	add_tmp_item 1440002 1 14600 14500 800 0 @30 @10 1
	add_tmp_item 1440002 1 12300 14900 800 0 @30 @10 1
	add_tmp_item 1440002 1 12200 11200 800 0 @30 @10 1
	add_tmp_item 1440002 1 14500 12400 800 0 @30 @10 1
	                                        
	add_tmp_item 1440003 1 13700 13600 800 0 @30 @10 1
	add_tmp_item 1440003 1 12700 13500 800 0 @30 @10 1
	add_tmp_item 1440003 1 14600 14500 800 0 @30 @10 1
	add_tmp_item 1440003 1 12300 14900 800 0 @30 @10 1
	add_tmp_item 1440003 1 12200 11200 800 0 @30 @10 1
	add_tmp_item 1440003 1 14500 12400 800 0 @30 @10 1
;;;;;                                        @30 @10
	;右下                                 
	add_tmp_item 1440002 1 12400 6400 800 0 @30 @10 1
	add_tmp_item 1440002 1 14100 6500 800 0 @30 @10 1
	add_tmp_item 1440002 1 15600 6100 800 0 @30 @10 1
	add_tmp_item 1440002 1 14500 5500 800 0 @30 @10 1
	add_tmp_item 1440002 1 14500 3600 800 0 @30 @10 1
	add_tmp_item 1440002 1 13700 4300 800 0 @30 @10 1
	add_tmp_item 1440002 1 12000 4200 800 0 @30 @10 1
	                                       
	add_tmp_item 1440003 1 12400 6400 800 0 @30 @10 11
	add_tmp_item 1440003 1 14100 6500 800 0 @30 @10 12
	add_tmp_item 1440003 1 15600 6100 800 0 @30 @10 13
	add_tmp_item 1440003 1 14500 5500 800 0 @30 @10 14
	add_tmp_item 1440003 1 14500 3600 800 0 @30 @10 15
	add_tmp_item 1440003 1 13700 4300 800 0 @30 @10 16
	add_tmp_item 1440003 1 12000 4200 800 0 @30 @10 10

endproc     

proc 120
	var 30 30
	;重刷时间
	var 10 10
	;停留时间
	rand 40 90
	;左上
	add_tmp_item 1440240 1 4300 14200 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 5400 14300 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 6800 14000 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 6600 12800 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 6500 11100 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 5200 12100 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 4100 13100 800 @40 @30 @10 1
	                                     
	rand 40 90
	add_tmp_item 1440240 1 4300 14200 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 5400 14300 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 6800 14000 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 6600 12800 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 6500 11100 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 5200 12100 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 4100 13100 800 @40 @30 @10 1
;;;;;;;;;;;                                 
	;左下
	rand 40 90
	add_tmp_item 1440240 1 4300 4100 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 3800 5600 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 4300 7000 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 5800 6900 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 7600 6500 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 7600 4500 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 5500 4800 800 @40 @30 @10 1
	                                       
	
	rand 40 90
	add_tmp_item 1440240 1 4300 4100 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 3800 5600 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 4300 7000 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 5800 6900 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 7600 6500 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 7600 4500 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 5500 4800 800 @40 @30 @10 1
	                                       
;;;;;;

endproc

proc 110
	var 30 30
	;重刷时间
	var 10 10
	;停留时间
	rand 40 90
	;朝向
	;右上
	rand 40 90
	add_tmp_item 1440240 1 13700 13600 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 12700 13500 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 14600 14500 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 12300 14900 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 12200 11200 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 14500 12400 800 @40 @30 @10 1
	                                     
	rand 40 90
	add_tmp_item 1440240 1 13700 13600 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 12700 13500 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 14600 14500 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 12300 14900 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 12200 11200 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 14500 12400 800 @40 @30 @10 1
;;;;;                                        @30 @10
	;右下                                 
	rand 40 90
	add_tmp_item 1440240 1 12400 6400 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 14100 6500 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 15600 6100 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 14500 5500 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 14500 3600 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 13700 4300 800 @40 @30 @10 1
	rand 40 90
	add_tmp_item 1440240 1 12000 4200 800 @40 @30 @10 1
	                                       
	rand 40 90
	add_tmp_item 1440240 1 12400 6400 800 @40 @30 @10 11
	rand 40 90
	add_tmp_item 1440240 1 14100 6500 800 @40 @30 @10 12
	rand 40 90
	add_tmp_item 1440240 1 15600 6100 800 @40 @30 @10 13
	rand 40 90
	add_tmp_item 1440240 1 14500 5500 800 @40 @30 @10 14
	rand 40 90
	add_tmp_item 1440240 1 14500 3600 800 @40 @30 @10 15
	rand 40 90
	add_tmp_item 1440240 1 13700 4300 800 @40 @30 @10 16
	rand 40 90
	add_tmp_item 1440240 1 12000 4200 800 @40 @30 @10 10
	                                   
endproc



 
proc 3
	get_pworld_var 4 8 1 20
	if 20 = 0
		get_pworld_var 0 32 1 10
		add 10 1
		set_pworld_var 0 32 @10 1
		if 10 = 1
			
			call 110
		endif
		if 10 = 10
			call 120
		endif
		if 10 = 145
		 add_sys_msg_start
		 add_sys_msg 准备随机分配阵营
		 set_sys_msg_mode 3 0 0
		 map_msg_info
		endif
		if 10 = 150
			
			call 100
			var 20 1
			set_pworld_var 4 8 @20 1
			
			var 10 0
			set_pworld_var 0 32 @10 1
		endif
	endif
endproc 

PROC 5
	;角色进入副本
	; add_sys_msg_start
	; add_sys_msg 准备时间，地上会随机刷出经验果
	; set_sys_msg_mode 7 0 0
	; msg_info
	
	EFFECT 2 1 SetMessageTips(180)

ENDPROC
proc 8
	
	
endproc 